#2_3字符串变量

#可以将字符串保存到变量中，输出字符串时仅需要将变量名放入print后面的括号即可

c='abcde'  #变量c中保存了字符串'abcde'的值

message="信息技术系"  #将字符串"Hello Python world!"保存到变量message中

#符号'='并不是数学中的等于号，而是赋值运算符，其功能就是将具体的值保存到变量中（给变量赋值）

print(message)  #输出变量message的值

#变量中保存的值是可以改变的，重新赋予新的值即可

message="教育信息技术学院"  #重新给字符串变量message赋值 
print(message)

#变量名由字母，数字，下划线组成，变量名的首字符可以是字母与下划线，但是不能是数字

#比如abc,s123,zx_45,_def12这些都是正确的变量名，123asd是不正确的变量名（数字开头）

#变量名中的大小写字母不能混用，比如message与Message是两个不同的变量

#通常变量名使用小写字母，这不是硬性规定，只是习惯而已












