#1_4 算术运算符

# 算术运算符包括：+(加)，-(减)，*(乘)，/(除)，%(求余)，**(乘方)，//(除法取整)

# 3+2等于5    3-2等于1    3*2等于6    3/2等于1.5

# 3%2(3除以2的余数)等于1  3**2(3的2次方)等于9

# a//b表示求不超过a除以b的最大整数，3//2等于1，-3//2等于-2

# 由算术运算符组成的算式被称为“算术表达式”

# 预测并验证下面语句的执行结果

print(5%2)

print(6%3)

print(4**2)

print(4**3)

print(10//2)

print(10//3)

print(-10//2)

print(-10//3)

#小数的运算时可能存在精度丢失的情况

print(3+2)

print(0.3+0.2)

print(3-2)

print(0.3-0.2)

print(3*2)

print(0.3*0.2)

print(3/2)

print(0.3/0.2)

















